yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
/**************************************************************************//**
 * @file     sys_reg.h
 * @version  V1.00
 * @brief    SYS register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __SYS_REG_H__
#define __SYS_REG_H__

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/** @addtogroup REGISTER Control Register

  @{

*/


/*---------------------- System Manger Controller -------------------------*/
/**
    @addtogroup SYS System Manger Controller(SYS)
    Memory Mapped Structure for SYS Controller
@{ */

typedef struct
{


/**
 * @var SYS_T::PDID
 * Offset: 0x00  Product and Device Identifier Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |PID       |Product ID
 * |        |          |This field stores the 8-bit Product ID loaded from OTP memory.
 * |[27:24] |DID       |Device ID
 * |        |          |This field stores the 4-bit Device ID loaded from OTP memory.
 * @var SYS_T::PWRON
 * Offset: 0x04  Power-on Setting Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |BTSSEL    |Boot Source Selection (Read Only)
 * |        |          |When pin nRESET transited from low to high, the value of pin PG[1:0] latched to BTSSEL.
 * |        |          |00= Boot from USB.
 * |        |          |01= Boot from SD/eMMC.
 * |        |          |10= Boot from NAND Flash.
 * |        |          |11= Boot from SPI Flash.
 * |[2]     |PINSECBTEN|Secure Boot Enabled/Disable Selection by Pin PG.2 (Read Only)
 * |        |          |When {SECBTDEVMD, SECBTEN} is 01, the value of pin PG.2 latched to PINSECBTEN during pin nRESET transited from low to high.
 * |        |          |0 = Secure Boot Enabled.
 * |        |          |1 = Secure Boot Disabled.
 * |[3]     |WDTON     |Watchdog Timer ON/OFF Selection (Read Only)
 * |        |          |When pin nRESET transited from low to high, the value of pin PG.3 latched to WDTON.
 * |        |          |0 = After power-on, WDT Disabled.
 * |        |          |1 = After power-on WDT Enabled.
 * |[4]     |JTAGSEL   |JTAG Interface Selection (Read Only)
 * |        |          |When pin nRESET transited from low to high, the value of pin PG.4 latched to JTAGSEL.
 * |        |          |0 = Pin PA[6:2] used as JTAG interface.
 * |        |          |1 = Pin PG[15:11] used as JTAG interface.
 * |[5]     |URDBGON   |UART 0 Debug Message Output ON/OFF Selection (Read Only)
 * |        |          |When pin nRESET transited from low to high, the value of pin PG.5 latched to URDBGON.
 * |        |          |0= UART 0 debug message output ON and pin PF[12:11] used as the UART0 functionality.
 * |        |          |1= UART 0 debug message output OFF.
 * |[7:6]   |NPAGESEL  |NAND Flash Page Size Selection (Read Only)
 * |        |          |When pin nRESET transited from low to high, the value of pin PG[7:6] latched to NPAGESEL.
 * |        |          |00= NAND Flash page size is 2KB.
 * |        |          |01= NAND Flash page size is 4KB.
 * |        |          |10= NAND Flash page size is 8KB.
 * |        |          |11= Ignore power-on setting.
 * |[9:8]   |MISCCFG   |Miscellaneous Configuration (Read Only)
 * |        |          |When pin nRESET transited from low to high, the value of pin PG[9:8] latched to MISCCFG.
 * |        |          |When BTSSEL = 01, Boot from SD/eMMC, the MISCCFG defines the SD0/eMMC0 or SD1/eMMC1 used as the booting source.
 * |        |          |00 = SD1/eMMC1 (GPB group) used as the booting source.
 * |        |          |01 = SD1/eMMC1 (GPF group) used as the booting source.
 * |        |          |10 = SD0/eMMC0 (GPH group) used as the booting source.
 * |        |          |11 = SD0/eMMC0 (GPC group) used as the booting source.
 * |        |          |When BTSSEL = 10, Boot from NAND Flash, the MISCCFG defines the ECC type.
 * |        |          |00 = No ECC.
 * |        |          |01 = ECC is BCH T12.
 * |        |          |10 = ECC is BCH T24.
 * |        |          |11 = Ignore power-on setting.
 * |        |          |When BTSEL = 11, Boot from SPI Flash, the MISCCFG defines the SPI Flash type and data width.
 * |        |          |00 = SPI-NAND Flash with 4-bit mode.
 * |        |          |01 = SPI-NAND Flash with 1-bit mode.
 * |        |          |10 = SPI-NOR Flash with 4-bit mode.
 * |        |          |11 = SPI-NOR Flash with 1-bit mode.
 * |[10]    |SECBTEN   |Secure Boot Enabled/Disable Control Bit (Read Only)
 * |        |          |This bit works with SECBTDEVMD to Enable/Disable secure boot.
 * |        |          |{SECBTDEVMD, SECBTEN}
 * |        |          |00 = Secure Boot Disabled.
 * |        |          |01 = Secure Boot Enabled/Disabled controlled by pin PG[2].
 * |        |          |10 = Secure Boot Disabled.
 * |        |          |11 = Secure Boot Enabled.
 * |[11]    |SECBTDEVMD|Secure Boot Development Mode Control Bit (Read Only)
 * |        |          |This bit works with SECBTEN to Enable/Disable secure boot.
 * |        |          |{SECBTDEVMD, SECBTEN}
 * |        |          |00 = Secure Boot Disabled.
 * |        |          |01 = Secure Boot Enabled/Disabled controlled by pin PG[2].
 * |        |          |10 = Secure Boot Disabled.
 * |        |          |11 = Secure Boot Enabled.
 * |[15]    |PWRONSRC  |Power On Setting Source Selelection Control Bit (Read Only)
 * |        |          |This bit control the power on setting value comes from power on setting pin or OTP content.
 * |        |          |0 = Power on setting values come from pin. (Default)
 * |        |          |1 = Power on setting values come from OTP.
 * |[16]    |USBID     |USB ID Pin Status
 * |        |          |0 = USB port 0 used as a USB device.
 * |        |          |1 = USB port 0 used as a USB host.
 * |[31:28] |BTDELAY   |BOOT Delay (Read Only)
 * |        |          |0000 = no delay.
 * |        |          |0001 = 10 ms.
 * |        |          |0010 = 25 ms.
 * |        |          |0011 = 50 ms.
 * |        |          |0100 = 80 ms.
 * |        |          |0101 = 125 ms.
 * |        |          |0110 = 160 ms.
 * |        |          |0111 = 200 ms.
 * |        |          |1000 = 300 ms.
 * |        |          |1001 = 500 ms.
 * |        |          |1010 = 750 ms.
 * |        |          |1011 = 1000 ms.
 * |        |          |1100 = 1500 ms.
 * |        |          |1101 = 2000 ms.
 * |        |          |1110 = 2500 ms.
 * |        |          |1111 = 3500 ms.
 * @var SYS_T::LVRDCR
 * Offset: 0x20  Low Voltage Reset & Detect Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LVR_EN    |Low Voltage Reset Enable Bit
 * |        |          |0 = Low voltage reset function Disabled.
 * |        |          |1 = Low voltage reset function Enabled.
 * |[8]     |LVD_EN    |Low Voltage Detect Enable Bit
 * |        |          |0 = Low voltage detect function Disabled.
 * |        |          |1 = Low voltage detect function Enabled.
 * |[9]     |LVD_SEL   |Low Voltage Detect Threshold Selection
 * |        |          |0 = Low voltage detection level is 2.6V.
 * |        |          |1 = Low voltage detection level is 2.8V.
 * @var SYS_T::MISCFCR
 * Offset: 0x30  Miscellaneous Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4]     |IBRACCEN  |ARM926EJ-S Core IBR Access Enable (Read Only)
 * |        |          |When IBRACCEN1=1, the ARM926EJ-S core read IBR (Internal Boot ROM) is enabled while IBRACCEN1=0, the ARM926EJ-S core read IBR (Internal Boot ROM) is disabled.
 * |        |          |0 = ARM926EJ-S core booting sequence completed and read IBR Disabled.
 * |        |          |1 = ARM926EJ-S core booting sequence is on-going and read IBR Enabled..
 * |[5]     |BOOTISRC  |Boot Image Source (Read Only)
 * |        |          |0 = Boot from header 0.
 * |        |          |1 = Boot from header 1.
 * |[8]     |WDTRSTEN  |WatchDog Timer Reset Connection Enable Bit
 * |        |          |This bit is use to enable the function that connect watch-dog timer reset to nRESET pin
 * |        |          |If this bit is enabled, the watch-dog timer reset is connected to nRESET pin internally
 * |        |          |0 = Watch-dog timer reset not connected to nRESET pin internally.
 * |        |          |1 = Watch-dog timer reset connected to nRESET pin internally.
 * |[9]     |HDSPUEN   |HDS Pin Internal Pull-up Enable Bit
 * |        |          |0 = HDS pin internal pull-up resister Disabled.
 * |        |          |1 = HDS pin internal pull-up resister Enabled.
 * |[10]    |EADCFUNCEN|EADC Controller Function Enable Bit
 * |        |          |0 = EADC controller function Disabled and SAR-ADC controlled by ADC controller.
 * |        |          |1 = EADC controller function Enabled and SAR-ADC controlled by EADC controller.
 * |[11]    |USRHDSEN  |User Configurable USB Host Device Role Selection Enable Bit
 * |        |          |0 = USB host/device role selection decided by HDS pin.
 * |        |          |1 = USB host/device role selection decided by USBID (SYS_PWRON[16]).
 * |[12]    |GPIOLBEN  |GPIO Pin Loop-back Enable Bit
 * |        |          |0 = GPIO input status didnu2019t reflect pin status if the GPIO configured as functional pin.
 * |        |          |1 = GPIO input status did reflect pin status even if the GPIO configured as functional pin.
 * |[13]    |SELFTEST  |Self-test Mode Enable Bit
 * |        |          |0 = Self-Test mode Disabled.
 * |        |          |1 = Self-Test mode Enabled.
 * @var SYS_T::MISCIER
 * Offset: 0x40  Miscellaneous Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LVD_IEN   |Low Voltage Detect Interrupt Enable Bit
 * |        |          |0 = Low voltage detect interrupt Disabled.
 * |        |          |1 = Low voltage detect interrupt Enabled.
 * |[1]     |USBIDC_IEN|USB0_ID Pin Status Change Interrupt Enable Bit
 * |        |          |0 = HDS status change interrupt Disabled.
 * |        |          |1 = HDS status change interrupt Enabled.
 * @var SYS_T::MISCISR
 * Offset: 0x44  Miscellaneous Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LVD_IS    |Low Voltage Detect Interrupt Status
 * |        |          |0 = No low voltage event.
 * |        |          |1 = Low voltage event detected.
 * |[1]     |USBIDC_IS |USB0_ID Pin State Change Interrupt Status
 * |        |          |0 = USB0_ID state didnu2019t change.
 * |        |          |1 = USB0_ID state changed from low to high or from high to low.
 * |[17]    |USB0_IDS  |USB0_ID Status
 * |        |          |0 = USB port 0 used as a USB device port.
 * |        |          |1 = USB port 0 used as a USB host port.
 * @var SYS_T::AHBIPRST
 * Offset: 0x60  AHB IP Reset Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CHIPRST   |Chip On-Shot Reset Enable Bit (Write Protect)
 * |        |          |This bit is used to generate a whole chip reset pulse.
 * |        |          |When set this bit high, reset controller generates a 6 system clock long reset pulse to rseet whole chip
 * |        |          |After the reset completed, this bit will be clear to low automatically.
 * |        |          |0 = Chip one-shot reset Disabled.
 * |        |          |1 = Chip one-shot reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[2]     |CPURST    |CPU Pulse Reset Enable Bit (Write Protect)
 * |        |          |This bit is used to generate a reset pulse to Arm926EJ-S CPU.
 * |        |          |When set this bit high, reset controller generates a 6 system clock long reset pulse to Arm926EJ-S CPU
 * |        |          |After the reset completed, this bit will be clear to low automatically.
 * |        |          |0 = CPU pulse reset Disabled.
 * |        |          |1 = CPU pulse reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[3]     |EBIRST    |EBI Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the EBI controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = EBI reset Disabled.
 * |        |          |1 = EBI reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[4]     |PDMA0RST  |PDMA0 Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the PDMA 0 controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = PDMA 0 reset Disabled.
 * |        |          |1 = PDMA 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[5]     |PDMA1RST  |PDMA1 Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the PDMA 1 controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = PDMA 1 reset Disabled.
 * |        |          |1 = PDMA 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[6]     |SDICRST   |SDRAM Controller Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the SDRAM controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SDRAM controller reset Disabled.
 * |        |          |1 = SDRAM Controller reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[7]     |GPIORST   |GPIO Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the GPIO controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = GPIO reset Disabled.
 * |        |          |1 = GPIO reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[8]     |I2SRST    |I2S Controller Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the I2S controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = I2S controller reset Disabled.
 * |        |          |1 = I2S controller reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[16]    |EMAC0RST  |Ethernet MAC 0 Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the Ethernet MAC 0 controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = Ethernet MAC 0 reset Disabled.
 * |        |          |1 = Ethernet MAC 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[17]    |EMAC1RST  |Ethernet MAC 1 Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the Ethernet MAC 1 controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = Ethernet MAC 1 reset Disabled.
 * |        |          |1 = Ethernet MAC 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[18]    |HSUSBHRST |High-Speed USB Host Controller Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the High-Speed USB host controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = High-Speed USB host controller (EHCI/OHCI) reset Disabled.
 * |        |          |1 = High-Speed USB host controller (EHCI/OHCI) reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[19]    |HSUSBDRST |High-Speed USB Device Controller Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the High-Speed USB device controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = High-Speed USB device controller reset Disabled.
 * |        |          |1 = High-Speed USB device controller reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[20]    |NDNDRST   |NAND Flash Controller Reset Enable Bit (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the NAND Flash controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = NAND Flash controller reset Disabled.
 * |        |          |1 = NAND Flash controller reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[21]    |KSRST     |KSRST Controller Reset (Write Protect)
 * |        |          |Set this bit to 1 will generate a reset signal to the KeyStore controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = KSRST controller normal operation.
 * |        |          |1 = KSRST controller reset.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[22]    |OTPRST    |OTPRST Controller Reset (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the OTP controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = OTPRST controller normal operation.
 * |        |          |1 = OTPRST controller reset.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[23]    |CRYPTORST |Cryptographic Accelerator Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the Cryptographic Accelerator
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = Cryptographic Accelerator reset Disabled.
 * |        |          |1 = Cryptographic Accelerator reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[24]    |SDH0RST   |SDIO Controller 0 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SDIO 0 controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SDIO controller 0 reset Disabled.
 * |        |          |1 = SDIO controller 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[25]    |SDH1RST   |SDIO Controller 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SDIO 1 controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SDIO controller 1 reset Disabled.
 * |        |          |1 = SDIO controller 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[28]    |CANFD0RST |CAN FD 0 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN FD 0
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN FD 0 reset Disabled.
 * |        |          |1 = CAN FD 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[29]    |CANFD1RST |CAN FD 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN FD 1
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN FD 1 reset Disabled.
 * |        |          |1 = CAN FD 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[30]    |CANFD2RST |CAN FD 2 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN FD 2
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN FD 2 reset Disabled.
 * |        |          |1 = CAN FD 2 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[31]    |CANFD3RST |CAN FD 3 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN FD 3
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN FD 3 reset Disabled.
 * |        |          |1 = CAN FD 3 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * @var SYS_T::APBIPRST0
 * Offset: 0x64  APB IP Reset Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11]    |TIMER3RST |TIMER 3 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the TIMER 3
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = TIMER 3 reset Disabled.
 * |        |          |1 = TIMER 3 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[12]    |TIMER4RST |TIMER 4 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the TIMER 4
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = TIMER 4 reset Disabled.
 * |        |          |1 = TIMER 4 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[13]    |TIMER5RST |TIMER 5 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the TIMER 5
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = TIMER 5 reset Disabled.
 * |        |          |1 = TIMER 5 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
