yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
 * |[16]    |UART0RST  |UART 0 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 0
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 0 reset Disabled.
 * |        |          |1 = UART 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[17]    |UART1RST  |UART 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 1
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 1 reset Disabled.
 * |        |          |1 = UART 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[18]    |UART2RST  |UART 2 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 2
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 2 reset Disabled.
 * |        |          |1 = UART 2 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[19]    |UART3RST  |UART 3 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 3
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 3 reset Disabled.
 * |        |          |1 = UART 3 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[20]    |UART4RST  |UART 4 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 4
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 4 reset Disabled.
 * |        |          |1 = UART 4 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[21]    |UART5RST  |UART 5 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 5
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 5 reset Disabled.
 * |        |          |1 = UART 5 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[22]    |UART6RST  |UART 6 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 6
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 6 reset Disabled.
 * |        |          |1 = UART 6 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[23]    |UART7RST  |UART 7 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 7
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 7 reset Disabled.
 * |        |          |1 = UART 7 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[24]    |UART8RST  |UART 8 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 9
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 8 reset Disabled.
 * |        |          |1 = UART 8 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[25]    |UART9RST  |UART 9 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the UART 9
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = UART 9 reset Disabled.
 * |        |          |1 = UART 9 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * @var SYS_T::APBIPRST1
 * Offset: 0x68  APB IP Reset Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |I2C0RST   |I2C 0 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the I2C 0
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = I2C 0 reset Disabled.
 * |        |          |1 = I2C 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[1]     |I2C1RST   |I2C 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the I2C 1
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = I2C 1 reset Disabled.
 * |        |          |1 = I2C 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[2]     |I2C2RST   |I2C 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the I2C 2
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = I2C 2 reset Disabled.
 * |        |          |1 = I2C 2 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[3]     |I2C3RST   |I2C 3 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the I2C 3
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = I2C 3 reset Disabled.
 * |        |          |1 = I2C 3 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[4]     |SPI0RST   |SPI 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SPI 0
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SPI 0 reset Disabled.
 * |        |          |1 = SPI 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[5]     |SPI1RST   |SPI 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SPI 1
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SPI 1 reset Disabled.
 * |        |          |1 = SPI 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[6]     |SPI2RST   |SPI 2 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SPI 2
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SPI 2 reset Disabled.
 * |        |          |1 = SPI 2 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[7]     |SPI3RST   |SPI 3 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SPI 3
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SPI 3 reset Disabled.
 * |        |          |1 = SPI 3 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[8]     |CAN0RST   |CAN 0 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN 0
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN 0 reset Disabled.
 * |        |          |1 = CAN 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[9]     |CAN1RST   |CAN 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN 1
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN 1 reset Disabled.
 * |        |          |1 = CAN 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[10]    |CAN2RST   |CAN 2 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN 2
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN 2 reset Disabled.
 * |        |          |1 = CAN 2 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[11]    |CAN3RST   |CAN 3 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the CAN 3
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = CAN 3 reset Disabled.
 * |        |          |1 = CAN 3 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[24]    |ADCRST    |ADC Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the ADC controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = ADC reset Disabled.
 * |        |          |1 = ADC reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[25]    |EADCRST   |EADC Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the EADC controller
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = EADC reset Disabled.
 * |        |          |1 = EADC reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[26]    |BPWM0RST  |BPWM0 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the BPWM 0
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = BPWM 0 reset Disabled.
 * |        |          |1 = BPWM 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[27]    |BPWM1RST  |BPWM1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the BPWM 1
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = BPWM 1 reset Disabled.
 * |        |          |1 = BPWM 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[30]    |SMC0RST   |SMC 0 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SMC 0
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SMC 0 reset Disabled.
 * |        |          |1 = SMC 0 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * |[31]    |SMC1RST   |SMC 1 Reset Enable Bit (Write Protect)
 * |        |          |Setting this bit to 1 will generate a reset signal to the SMC 1
 * |        |          |User needs to set this bit to 0 to release from the reset state.
 * |        |          |0 = SMC 1 reset Disabled.
 * |        |          |1 = SMC 1 reset Enabled.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLKCTL register.
 * @var SYS_T::RSTSTS
 * Offset: 0x6C  Reset Source Active Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PORRSTS   |Chip Reset by POR Status
 * |        |          |0 = No reset from POR.
 * |        |          |1 = POR had issued reset signal to reset the chip.
 * |[1]     |PINRSTS   |Chip Reset by NRESET Pin Status
 * |        |          |0 = No reset from nRESET pin.
 * |        |          |1 = nRESET pin had issued reset signal to reset the chip.
 * |[2]     |LVRRSTS   |Chip Reset by LVRD Status
 * |        |          |0 = No reset from LVRD.
 * |        |          |1 = LVRD had issued reset signal to reset the chip.
 * |[3]     |CHIPRSTS  |Chip Reset by CHIP Status
 * |        |          |0 = No reset from CHIP (AHBIPRST[0]).
 * |        |          |1 = CHIP (AHBIPRST[0]) has been high to reset CPU.
 * |[4]     |CPURSTS   |CPU Reset by CPU_LVL or CPU_PLS Status
 * |        |          |0 = No CPU reset from CPU_LVL (AHBIPRST[1]) or CPU_PLS (AHBIPRST[2]).
 * |        |          |1 = CPU_LVL (AHBIPRST[1]) or CPU_PLS (AHBIPRST[2]) has been high to reset the CPU.
 * |[5]     |WDTRSTS   |Chip Reset by Watchdog Timer Status
 * |        |          |0 = No reset from watchdog timer.
 * |        |          |1 = Watchdog timer had issued reset signal to reset the chip.
 * |[6]     |WWDTRSTS  |Chip Reset by Window-Watchdog Timer Status
 * |        |          |0 = No reset from window watchdog timer.
 * |        |          |1 = Window watchdog timer had issued reset signal to reset the chip.
 * @var SYS_T::GPA_MFPL
 * Offset: 0x70  GPIOA Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPA0  |Pin PA.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPA1  |Pin PA.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPA2  |Pin PA.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPA3  |Pin PA.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPA4  |Pin PA.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPA5  |Pin PA.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPA6  |Pin PA.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPA7  |Pin PA.7 Multi-function Pin Selection
 * @var SYS_T::GPA_MFPH
 * Offset: 0x74  GPIOA High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPA8  |Pin PA.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPA9  |Pin PA.9 Multi-function Pin Selection
 * |[11:8]  |MFP_GPA10 |Pin PA.10 Multi-function Pin Selection
 * |[15:12] |MFP_GPA11 |Pin PA.11 Multi-function Pin Selection
 * |[19:16] |MFP_GPA12 |Pin PA.12 Multi-function Pin Selection
 * |[23:20] |MFP_GPA13 |Pin PA.13 Multi-function Pin Selection
 * |[27:24] |MFP_GPA14 |Pin PA.14 Multi-function Pin Selection
 * |[31:28] |MFP_GPA15 |Pin PA.15 Multi-function Pin Selection
 * @var SYS_T::GPB_MFPL
 * Offset: 0x78  GPIOB Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPB0  |Pin PB.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPB1  |Pin PB.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPB2  |Pin PB.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPB3  |Pin PB.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPB4  |Pin PB.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPB5  |Pin PB.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPB6  |Pin PB.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPB7  |Pin PB.7 Multi-function Pin Selection
 * @var SYS_T::GPB_MFPH
 * Offset: 0x7C  GPIOB High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPB8  |Pin PB.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPB9  |Pin PB.9 Multi-function Pin Selection
 * |[11:8]  |MFP_GPB10 |Pin PB.10 Multi-function Pin Selection
 * |[15:12] |MFP_GPB11 |Pin PB.11 Multi-function Pin Selection
 * |[19:16] |MFP_GPB12 |Pin PB.12 Multi-function Pin Selection
 * |[23:20] |MFP_GPB13 |Pin PB.13 Multi-function Pin Selection
 * @var SYS_T::GPC_MFPL
 * Offset: 0x80  GPIOC Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPC0  |Pin PC.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPC1  |Pin PC.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPC2  |Pin PC.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPC3  |Pin PC.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPC4  |Pin PC.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPC5  |Pin PC.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPC6  |Pin PC.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPC7  |Pin PC.7 Multi-function Pin Selection
 * @var SYS_T::GPC_MFPH
 * Offset: 0x84  GPIOC High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPC8  |Pin PC.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPC9  |Pin PC.9 Multi-function Pin Selection
 * |[11:8]  |MFP_GPC10 |Pin PC.10 Multi-function Pin Selection
 * |[15:12] |MFP_GPC11 |Pin PC.11 Multi-function Pin Selection
 * |[19:16] |MFP_GPC12 |Pin PC.12 Multi-function Pin Selection
 * |[23:20] |MFP_GPC13 |Pin PC.13 Multi-function Pin Selection
 * |[27:24] |MFP_GPC14 |Pin PC.14 Multi-function Pin Selection
 * |[31:28] |MFP_GPC15 |Pin PC.15 Multi-function Pin Selection
 * @var SYS_T::GPD_MFPL
 * Offset: 0x88  GPIOD Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPD0  |Pin PD.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPD1  |Pin PD.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPD2  |Pin PD.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPD3  |Pin PD.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPD4  |Pin PD.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPD5  |Pin PD.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPD6  |Pin PD.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPD7  |Pin PD.7 Multi-function Pin Selection
 * @var SYS_T::GPD_MFPH
 * Offset: 0x8C  GPIOD High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPD8  |Pin PD.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPD9  |Pin PD.9 Multi-function Pin Selection
 * |[11:8]  |MFP_GPD10 |Pin PD.10 Multi-function Pin Selection
 * |[15:12] |MFP_GPD11 |Pin PD.11 Multi-function Pin Selection
 * |[19:16] |MFP_GPD12 |Pin PD.12 Multi-function Pin Selection
 * |[23:20] |MFP_GPD13 |Pin PD.13 Multi-function Pin Selection
 * |[27:24] |MFP_GPD14 |Pin PD.14 Multi-function Pin Selection
 * |[31:28] |MFP_GPD15 |Pin PD.15 Multi-function Pin Selection
 * @var SYS_T::GPE_MFPL
 * Offset: 0x90  GPIOE Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPE0  |Pin PE.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPE1  |Pin PE.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPE2  |Pin PE.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPE3  |Pin PE.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPE4  |Pin PE.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPE5  |Pin PE.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPE6  |Pin PE.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPE7  |Pin PE.7 Multi-function Pin Selection
 * @var SYS_T::GPE_MFPH
 * Offset: 0x94  GPIOE High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPE8  |Pin PE.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPE9  |Pin PE.9 Multi-function Pin Selection
 * |[11:8]  |MFP_GPE10 |Pin PE.10 Multi-function Pin Selection
 * |[15:12] |MFP_GPE11 |Pin PE.11 Multi-function Pin Selection
 * |[19:16] |MFP_GPE12 |Pin PE.12 Multi-function Pin Selection
 * @var SYS_T::GPF_MFPL
 * Offset: 0x98  GPIOF Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPF0  |Pin PF.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPF1  |Pin PF.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPF2  |Pin PF.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPF3  |Pin PF.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPF4  |Pin PF.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPF5  |Pin PF.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPF6  |Pin PF.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPF7  |Pin PF.7 Multi-function Pin Selection
 * @var SYS_T::GPF_MFPH
 * Offset: 0x9C  GPIOF High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPF8  |Pin PF.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPF9  |Pin PF.9 Multi-function Pin Selection
 * |[11:8]  |MFP_GPF10 |Pin PF.10 Multi-function Pin Selection
 * |[15:12] |MFP_GPF11 |Pin PF.11 Multi-function Pin Selection
 * |[19:16] |MFP_GPF12 |Pin PF.12 Multi-function Pin Selection
 * @var SYS_T::GPG_MFPL
 * Offset: 0xA0  GPIOG Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPG0  |Pin PG.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPG1  |Pin PG.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPG2  |Pin PG.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPG3  |Pin PG.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPG4  |Pin PG.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPG5  |Pin PG.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPG6  |Pin PG.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPG7  |Pin PG.7 Multi-function Pin Selection
 * @var SYS_T::GPG_MFPH
 * Offset: 0xA4  GPIOG High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPG8  |Pin PG.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPG9  |Pin PG.9 Multi-function Pin Selection
 * |[11:8]  |MFP_GPG10 |Pin PG.10 Multi-function Pin Selection
