yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
 * |[15:12] |MFP_GPG11 |Pin PG.11 Multi-function Pin Selection
 * |[19:16] |MFP_GPG12 |Pin PG.12 Multi-function Pin Selection
 * |[23:20] |MFP_GPG13 |Pin PG.13 Multi-function Pin Selection
 * |[27:24] |MFP_GPG14 |Pin PG.14 Multi-function Pin Selection
 * |[31:28] |MFP_GPG15 |Pin PG.15 Multi-function Pin Selection
 * @var SYS_T::GPH_MFPL
 * Offset: 0xA8  GPIOH Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPH0  |Pin PH.0 Multi-function Pin Selection
 * |[7:4]   |MFP_GPH1  |Pin PH.1 Multi-function Pin Selection
 * |[11:8]  |MFP_GPH2  |Pin PH.2 Multi-function Pin Selection
 * |[15:12] |MFP_GPH3  |Pin PH.3 Multi-function Pin Selection
 * |[19:16] |MFP_GPH4  |Pin PH.4 Multi-function Pin Selection
 * |[23:20] |MFP_GPH5  |Pin PH.5 Multi-function Pin Selection
 * |[27:24] |MFP_GPH6  |Pin PH.6 Multi-function Pin Selection
 * |[31:28] |MFP_GPH7  |Pin PH.7 Multi-function Pin Selection
 * @var SYS_T::GPH_MFPH
 * Offset: 0xAC  GPIOH High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |MFP_GPH8  |Pin PH.8 Multi-function Pin Selection
 * |[7:4]   |MFP_GPH9  |Pin PH.9 Multi-function Pin Selection
 * @var SYS_T::DDR_DSCTL
 * Offset: 0xF0  DDR I/O Driving Strength Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |CLK_DS    |DDR Clock I/O Driving Strength Selection
 * |        |          |This bit controls the driving strength for DDR I/O used as clock.
 * |        |          |00 = Reserved.
 * |        |          |01 = Reduced Strength.
 * |        |          |10 = Reserved.
 * |        |          |11 = Full Strength.
 * |[3:2]   |CTRL_DS   |DDR Control I/O Driving Strength Selection
 * |        |          |This bit controls the driving strength for DDR I/O used as control signals.
 * |        |          |00 = Reserved.
 * |        |          |01 = Reduced Strength.
 * |        |          |10 = Reserved.
 * |        |          |11 = Full Strength.
 * |[5:4]   |ADDR_DS   |DDR Address I/O Driving Strength Selection
 * |        |          |This bit controls the driving strength for DDR I/O used as address.
 * |        |          |00 = Reserved.
 * |        |          |01 = Reduced Strength.
 * |        |          |10 = Reserved.
 * |        |          |11 = Full Strength.
 * |[7:6]   |DATA_DS   |DDR Data I/O Driving Strength Selection
 * |        |          |This bit controls the driving strength for DDR I/O used as data.
 * |        |          |00 = Reserved.
 * |        |          |01 = Reduced Strength.
 * |        |          |10 = Reserved.
 * |        |          |11 = Full Strength.
 * @var SYS_T::GPBL_DSCTL
 * Offset: 0xF4  GPIOB Low Byte Driving Strength Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |DS_GPB0   |Pin PB.0 Driving Strength Selection
 * |        |          |This field controls the pin PB.0 driving strength
 * |        |          |000 = Pin PB.0 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.0 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.0 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.0 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.0 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.0 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.0 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.0 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * |[7:4]   |DS_GPB1   |Pin PB.1 Driving Strength Selection
 * |        |          |This field controls the pin PB.1 driving strength
 * |        |          |000 = Pin PB.1 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.1 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.1 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.1 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.1 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.1 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.1 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.1 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * |[11:8]  |DS_GPB2   |Pin PB.2 Driving Strength Selection
 * |        |          |This field controls the pin PB.2 driving strength
 * |        |          |000 = Pin PB.2 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.2 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.2 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.2 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.2 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.2 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.2 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.2 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * |[15:12] |DS_GPB3   |Pin PB.3 Driving Strength Selection
 * |        |          |This field controls the pin PB.3 driving strength
 * |        |          |000 = Pin PB.3 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.3 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.3 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.3 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.3 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.3 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.3 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.3 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * |[19:16] |DS_GPB4   |Pin PB.4 Driving Strength Selection
 * |        |          |This field controls the pin PB.4 driving strength
 * |        |          |000 = Pin PB.4 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.4 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.4 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.4 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.4 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.4 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.4 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.4 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * |[23:20] |DS_GPB5   |Pin PB.5 Driving Strength Selection
 * |        |          |This field controls the pin PB.5 driving strength
 * |        |          |000 = Pin PB.5 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.5 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.5 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.5 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.5 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.5 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.5 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.5 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * |[27:24] |DS_GPB6   |Pin PB.6 Driving Strength Selection
 * |        |          |This field controls the pin PB.6 driving strength
 * |        |          |000 = Pin PB.6 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.6 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.6 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.6 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.6 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.6 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.6 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.6 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * |[31:28] |DS_GPB7   |Pin PB.7 Driving Strength Selection
 * |        |          |This field controls the pin PB.7 driving strength
 * |        |          |000 = Pin PB.7 driving strength is 2.2mA.
 * |        |          |001 = Pin PB.7 driving strength is 6.5mA.
 * |        |          |010 = Pin PB.7 driving strength is 8.7mA.
 * |        |          |011 = Pin PB.7 driving strength is 13.0mA.
 * |        |          |100 = Pin PB.7 driving strength is 15.2mA.
 * |        |          |101 = Pin PB.7 driving strength is 19.5mA.
 * |        |          |110 = Pin PB.7 driving strength is 21.7mA.
 * |        |          |111 = Pin PB.7 driving strength is 26.1mA.
 * |        |          |Others = Reserved.
 * @var SYS_T::PORDISCR
 * Offset: 0x100  Power-On-reset Disable Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |POR_DIS_CODE|Power-on-reset Disable Code (Write Protect)
 * |        |          |When powered on, the Power-On-Reset (POR) circuit generates a reset signal to reset whole chip function
 * |        |          |However, after power is ready, the POR circuit would consume a few power
 * |        |          |To minimize the POR circuit power consumption, user to disable POR circuit by writing 0x5AA5 to this field.
 * |        |          |The POR circuit will become active again when this field is set to other value or chip is reset by other reset source, including /RESET pin, Watchdog, LVR reset and the software chip reset function.
 * |        |          |This field is protected
 * |        |          |It means that before programming it, user has to write u201C59hu201D, u201C16hu201D and u201C88hu201D to address 0xB000_01A0 continuously to disable the register protection
 * |        |          |Refer to the register SYS_REGLKCTL at address SYS_BA+0x1A0 for detail.
 * @var SYS_T::RSTDEBCTL
 * Offset: 0x10C  Reset Pin De-bounce Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |DEBCNT    |Reset Pin De-bounce Counter
 * |        |          |This 16-bit external RESET De-bounce Counter can specify the external RESET de-bounce time up to around 5.46ms (0xFFFF) @ XIN=12 MHz.
 * |        |          |The default external RESET de-bounce time is 0.1ms (0x04B0) @ XIN = 12 MHz.
 * |[31]    |RSTDEBEN  |Reset Pin De-bounce Enable Bit
 * |        |          |0 = Reset pin de-bounce Disabled. (Default)
 * |        |          |1 = Reset pin de-bounce Enabled.
 * @var SYS_T::MACAD0LSR
 * Offset: 0x110  MAC Address 0 Low Significant Word Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |MACADRLSR |MAC Address Low Significant Word Register
 * @var SYS_T::MACAD0HSR
 * Offset: 0x114  MAC Address 0 High Significant Word Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |MACADRHSR |MAC Address High Significant Word Register
 * @var SYS_T::MACAD1LSR
 * Offset: 0x118  MAC Address 1 Low Significant Word Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |MACADRLSR |MAC Address Low Significant Word Register
 * @var SYS_T::MACAD1HSR
 * Offset: 0x11C  MAC Address 1 High Significant Word Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |MACADRHSR |MAC Address High Significant Word Register
 * @var SYS_T::UID0
 * Offset: 0x180  Unique Identifier Word 0 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |UID       |Unique ID
 * |        |          |Unique identify number of the chip.
 * |        |          |Loaded from OTP automatically during chip power on.
 * @var SYS_T::UID1
 * Offset: 0x184  Unique Identifier Word 1 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |UID       |Unique ID
 * |        |          |Unique identify number of the chip.
 * |        |          |Loaded from OTP automatically during chip power on.
 * @var SYS_T::UID2
 * Offset: 0x188  Unique Identifier Word 2 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |UID       |Unique ID
 * |        |          |Unique identify number of the chip.
 * |        |          |Loaded from OTP automatically during chip power on.
 * @var SYS_T::UCID0
 * Offset: 0x190  Unique Customer Identifier Word 0 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |UCID      |Unique Customer ID
 * |        |          |Unique customer identifier number of the chip.
 * |        |          |Loaded from OTP automatically during chip power on.
 * @var SYS_T::UCID1
 * Offset: 0x194  Unique Customer Identifier Word 1 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |UCID      |Unique Customer ID
 * |        |          |Unique customer identifier number of the chip.
 * |        |          |Loaded from OTP automatically during chip power on.
 * @var SYS_T::UCID2
 * Offset: 0x198  Unique Customer Identifier Word 2 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |UCID      |Unique Customer ID
 * |        |          |Unique customer identifier number of the chip.
 * |        |          |Loaded from OTP automatically during chip power on.
 * @var SYS_T::REGLKCTL
 * Offset: 0x1A0  Register Lock Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |REGLCTL   |Register Lock Control Code (Write Only)
 * |        |          |Some registers have write-protection function
 * |        |          |Writing these registers have to disable the protected function by writing the sequence value u201C59hu201D, u201C16hu201D, u201C88hu201D to this field
 * |        |          |After this sequence is completed, the REGLCTL bit will be set to 1 and write-protection registers can be normal write.
 * |        |          |REGLCTL[0]
 * |        |          |Register Lock Control Disable Index (Read Only)
 * |        |          |0 = Write-protection Enabled for writing protected registers
 * |        |          |Any write to the protected register is ignored.
 * |        |          |1 = Write-protection Disabled for writing protected registers.
 * @var SYS_T::DPLPASWD
 * Offset: 0x1B0  Deployed Password Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |DPLPASWD  |Deployed Password
 * |        |          |The DPLPASWD loaded from OTP during chip power on and used for authentication when user want to modify PLM (Product Life-cycle Management) from Deployed stage to RMA stage
 * @var SYS_T::OTPCHKER
 * Offset: 0x1B4  OTP Checker Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |OTPCHKER  |OTP Checker
 * |        |          |The OTPCHKER loaded from OTP during chip power on and used to know if the OTP checker is correct.
 * @var SYS_T::PLMSTS
 * Offset: 0x1B8  Product Life-Cycle Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |STAGE     |Current Product Life-Cycle Stage (Read Only)
 * |        |          |000 = Vender Stage.
 * |        |          |001 = Develop Stage.
 * |        |          |01x = Deployed Stage.
 * |        |          |1xx = RMA Stage.
 * |[31:24] |RVCODE    |Read Verify Code (Read Only)
 * |        |          |Read verify code should be 0xA5.
 * @var SYS_T::PNUMREVR
 * Offset: 0x1F0  Product Number and Revision Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PRDNUML1  |Product Number Letter 1
 * |        |          |0x4
 * |[7:4]   |PRDNUML2  |Product Number Letter 2
 * |        |          |0x3
 * |[11:8]  |PRDNUML3  |Product Number Letter 3
 * |        |          |0x0
 * |[15:12] |PRDNUML4  |Product Number Letter 4
 * |        |          |0xD
 * |[19:16] |PRDNUML5  |Product Number Letter 5
 * |        |          |0 = A.
 * |[23:20] |PRDNUML6  |Product Number Letter 6
 * |        |          |0 = D (250nm).
 * |        |          |1 = F (180nm).
 * |        |          |2 = G (130nm).
 * |        |          |3 = H (110nm).
 * |        |          |4 = K (90nm).
 * |        |          |5 = L (55nm).
 * |        |          |6 = M (40nm).
 * |[27:24] |REV       |Chip Revision
 * |        |          |0 = Revision A.
 * |        |          |1 = Revision B.
 * |[31:28] |Foundry   |Foundry Code
 * |        |          |0 = TSMC.
 * |        |          |1 = SMIC.
 * @var SYS_T::CHIPCFG
 * Offset: 0x1F4  Chip Configuration Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4]     |CANFD0DIS |CAN FD 0 Function Disable Bit
 * |        |          |0 = CAN FD 0 Function Enabled. (Default)
 * |        |          |1 = CAN FD 0 Function Disabled.
 * |[5]     |CANFD1DIS |CAN FD 1 Function Disable Bit
 * |        |          |0 = CAN FD 1 Function Enabled. (Default)
 * |        |          |1 = CAN FD 1 Function Disabled.
 * |[6]     |CANFD2DIS |CAN FD 2 Function Disable Bit
 * |        |          |0 = CAN FD 2 Function Enabled. (Default)
 * |        |          |1 = CAN FD 2 Function Disabled.
 * |[7]     |CANFD3DIS |CAN FD 3 Function Disable Bit
 * |        |          |0 = CAN FD 3 Function Enabled. (Default)
 * |        |          |1 = CAN FD 3 Function Disabled.
 * |[15:14] |DDRTYPE   |DDR SDRAM Type
 * |        |          |00 = SDRAM type is SDR (Single Data Rate SDRAM).
 * |        |          |01 = Reserved.
 * |        |          |10 = SDRAM type is DDR SDRAM (Double Data Rate SDRAM).
 * |        |          |11 = SDRAM type is DDR2 SDRAM. (default)
 * |[19:16] |DRAMSIZE  |DDR SDRAM Size
 * |        |          |0000 = Non MCP.
 * |        |          |0001 = 2M Bytes.
 * |        |          |0010 = 4M Bytes.
 * |        |          |0011 = 8M Bytes.
 * |        |          |0100 = 16M Bytes.
 * |        |          |0101 = 32M Bytes.
 * |        |          |0110 = 64M Bytes. (default)
 * |        |          |0111 = 128M Bytes.
 * |        |          |1000 = 256M Bytes.
 * |        |          |Others = Reserved.
 * |[21:20] |DDRVENDR  |DDR SDRAM Vendor
 * |        |          |00 = Winbond.
 * |        |          |01 = Reserved.
 * |        |          |10 = Reserved.
 * |        |          |11 = Reserved.
 * |[23:22] |DDRPRCES  |DDR SDRAM Process Node
 * |        |          |00 = 25nm.
 * |        |          |01 = Reserved.
 * |        |          |10 = Reserved.
 * |        |          |11 = Reserved.
 * |[31:24] |APPID     |Application ID
 * @var SYS_T::IBRAENCLR
 * Offset: 0x1FC  IBR Access Enable Clear Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |IBRACCENCLR|IBR Access Enable Clear (Read Only)
 * |        |          |ARM926EJ-S core read this register to clear IBRACCEN (SYS_MISCFCR[4]).
 */
    __I  uint32_t PDID;                  /*!< [0x0000] Product and Device Identifier Register                           */
    __IO uint32_t PWRON;                 /*!< [0x0004] Power-on Setting Register                                        */
    __I  uint32_t RESERVE0[6];
    __IO uint32_t LVRDCR;                /*!< [0x0020] Low Voltage Reset & Detect Control Register                      */
    __I  uint32_t RESERVE1[3];
    __IO uint32_t MISCFCR;               /*!< [0x0030] Miscellaneous Function Control Register                          */
    __I  uint32_t RESERVE2[3];
    __IO uint32_t MISCIER;               /*!< [0x0040] Miscellaneous Interrupt Enable Register                          */
    __IO uint32_t MISCISR;               /*!< [0x0044] Miscellaneous Interrupt Status Register                          */
    __I  uint32_t RESERVE3[6];
    __IO uint32_t AHBIPRST;              /*!< [0x0060] AHB IP Reset Control Register                                    */
    __IO uint32_t APBIPRST0;             /*!< [0x0064] APB IP Reset Control Register 0                                  */
    __IO uint32_t APBIPRST1;             /*!< [0x0068] APB IP Reset Control Register 1                                  */
    __IO uint32_t RSTSTS;                /*!< [0x006c] Reset Source Active Status Register                              */
    __IO uint32_t GPA_MFPL;              /*!< [0x0070] GPIOA Low Byte Multiple Function Control Register                */
    __IO uint32_t GPA_MFPH;              /*!< [0x0074] GPIOA High Byte Multiple Function Control Register               */
    __IO uint32_t GPB_MFPL;              /*!< [0x0078] GPIOB Low Byte Multiple Function Control Register                */
    __IO uint32_t GPB_MFPH;              /*!< [0x007c] GPIOB High Byte Multiple Function Control Register               */
    __IO uint32_t GPC_MFPL;              /*!< [0x0080] GPIOC Low Byte Multiple Function Control Register                */
    __IO uint32_t GPC_MFPH;              /*!< [0x0084] GPIOC High Byte Multiple Function Control Register               */
    __IO uint32_t GPD_MFPL;              /*!< [0x0088] GPIOD Low Byte Multiple Function Control Register                */
    __IO uint32_t GPD_MFPH;              /*!< [0x008c] GPIOD High Byte Multiple Function Control Register               */
    __IO uint32_t GPE_MFPL;              /*!< [0x0090] GPIOE Low Byte Multiple Function Control Register                */
    __IO uint32_t GPE_MFPH;              /*!< [0x0094] GPIOE High Byte Multiple Function Control Register               */
    __IO uint32_t GPF_MFPL;              /*!< [0x0098] GPIOF Low Byte Multiple Function Control Register                */
    __IO uint32_t GPF_MFPH;              /*!< [0x009c] GPIOF High Byte Multiple Function Control Register               */
