yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
    __IO uint32_t GPG_MFPL;              /*!< [0x00a0] GPIOG Low Byte Multiple Function Control Register                */
    __IO uint32_t GPG_MFPH;              /*!< [0x00a4] GPIOG High Byte Multiple Function Control Register               */
    __IO uint32_t GPH_MFPL;              /*!< [0x00a8] GPIOH Low Byte Multiple Function Control Register                */
    __IO uint32_t GPH_MFPH;              /*!< [0x00ac] GPIOH High Byte Multiple Function Control Register               */
    __I  uint32_t RESERVE4[16];
    __IO uint32_t DDR_DSCTL;             /*!< [0x00f0] DDR I/O Driving Strength Control Register                        */
    __IO uint32_t GPBL_DSCTL;            /*!< [0x00f4] GPIOB Low Byte Driving Strength Control Register                 */
    __I  uint32_t RESERVE5[2];
    __IO uint32_t PORDISCR;              /*!< [0x0100] Power-On-reset Disable Control Register                          */
    __I  uint32_t RESERVE6[2];
    __IO uint32_t RSTDEBCTL;             /*!< [0x010c] Reset Pin De-bounce Control Register                             */
    __I  uint32_t MACAD0LSR;             /*!< [0x0110] MAC Address 0 Low Significant Word Register                      */
    __I  uint32_t MACAD0HSR;             /*!< [0x0114] MAC Address 0 High Significant Word Register                     */
    __I  uint32_t MACAD1LSR;             /*!< [0x0118] MAC Address 1 Low Significant Word Register                      */
    __I  uint32_t MACAD1HSR;             /*!< [0x011c] MAC Address 1 High Significant Word Register                     */
    __I  uint32_t RESERVE7[24];
    __I  uint32_t UID0;                  /*!< [0x0180] Unique Identifier Word 0 Register                                */
    __I  uint32_t UID1;                  /*!< [0x0184] Unique Identifier Word 1 Register                                */
    __I  uint32_t UID2;                  /*!< [0x0188] Unique Identifier Word 2 Register                                */
    __I  uint32_t RESERVE8[1];
    __I  uint32_t UCID0;                 /*!< [0x0190] Unique Customer Identifier Word 0 Register                       */
    __I  uint32_t UCID1;                 /*!< [0x0194] Unique Customer Identifier Word 1 Register                       */
    __I  uint32_t UCID2;                 /*!< [0x0198] Unique Customer Identifier Word 2 Register                       */
    __I  uint32_t RESERVE9[1];
    __O  uint32_t REGLKCTL;              /*!< [0x01a0] Register Lock Control Register                                   */
    __I  uint32_t RESERVE10[3];
    __I  uint32_t DPLPASWD;              /*!< [0x01b0] Deployed Password Register                                       */
    __I  uint32_t OTPCHKER;              /*!< [0x01b4] OTP Checker Register                                             */
    __I  uint32_t PLMSTS;                /*!< [0x01b8] Product Life-Cycle Status Register                               */
    __I  uint32_t RESERVE11[13];
    __I  uint32_t PNUMREVR;              /*!< [0x01f0] Product Number and Revision Register                             */
    __I  uint32_t CHIPCFG;               /*!< [0x01f4] Chip Configuration Register                                      */
    __I  uint32_t RESERVE12[1];
    __I  uint32_t IBRAENCLR;             /*!< [0x01fc] IBR Access Enable Clear Register                                 */

} SYS_T;

/**
    @addtogroup SYS_CONST SYS Bit Field Definition
    Constant Definitions for SYS Controller
@{ */

#define SYS_PDID_PID_Pos                 (0)                                               /*!< SYS_T::PDID: PID Position              */
#define SYS_PDID_PID_Msk                 (0xfful << SYS_PDID_PID_Pos)                      /*!< SYS_T::PDID: PID Mask                  */

#define SYS_PDID_DID_Pos                 (24)                                              /*!< SYS_T::PDID: DID Position              */
#define SYS_PDID_DID_Msk                 (0xful << SYS_PDID_DID_Pos)                       /*!< SYS_T::PDID: DID Mask                  */

#define SYS_PWRON_BTSSEL_Pos             (0)                                               /*!< SYS_T::PWRON: BTSSEL Position          */
#define SYS_PWRON_BTSSEL_Msk             (0x3ul << SYS_PWRON_BTSSEL_Pos)                   /*!< SYS_T::PWRON: BTSSEL Mask              */

#define SYS_PWRON_PINSECBTEN_Pos         (2)                                               /*!< SYS_T::PWRON: PINSECBTEN Position      */
#define SYS_PWRON_PINSECBTEN_Msk         (0x1ul << SYS_PWRON_PINSECBTEN_Pos)               /*!< SYS_T::PWRON: PINSECBTEN Mask          */

#define SYS_PWRON_WDTON_Pos              (3)                                               /*!< SYS_T::PWRON: WDTON Position           */
#define SYS_PWRON_WDTON_Msk              (0x1ul << SYS_PWRON_WDTON_Pos)                    /*!< SYS_T::PWRON: WDTON Mask               */

#define SYS_PWRON_JTAGSEL_Pos            (4)                                               /*!< SYS_T::PWRON: JTAGSEL Position         */
#define SYS_PWRON_JTAGSEL_Msk            (0x1ul << SYS_PWRON_JTAGSEL_Pos)                  /*!< SYS_T::PWRON: JTAGSEL Mask             */

#define SYS_PWRON_URDBGON_Pos            (5)                                               /*!< SYS_T::PWRON: URDBGON Position         */
#define SYS_PWRON_URDBGON_Msk            (0x1ul << SYS_PWRON_URDBGON_Pos)                  /*!< SYS_T::PWRON: URDBGON Mask             */

#define SYS_PWRON_NPAGESEL_Pos           (6)                                               /*!< SYS_T::PWRON: NPAGESEL Position        */
#define SYS_PWRON_NPAGESEL_Msk           (0x3ul << SYS_PWRON_NPAGESEL_Pos)                 /*!< SYS_T::PWRON: NPAGESEL Mask            */

#define SYS_PWRON_MISCCFG_Pos            (8)                                               /*!< SYS_T::PWRON: MISCCFG Position         */
#define SYS_PWRON_MISCCFG_Msk            (0x3ul << SYS_PWRON_MISCCFG_Pos)                  /*!< SYS_T::PWRON: MISCCFG Mask             */

#define SYS_PWRON_SECBTEN_Pos            (10)                                              /*!< SYS_T::PWRON: SECBTEN Position         */
#define SYS_PWRON_SECBTEN_Msk            (0x1ul << SYS_PWRON_SECBTEN_Pos)                  /*!< SYS_T::PWRON: SECBTEN Mask             */

#define SYS_PWRON_SECBTDEVMD_Pos         (11)                                              /*!< SYS_T::PWRON: SECBTDEVMD Position      */
#define SYS_PWRON_SECBTDEVMD_Msk         (0x1ul << SYS_PWRON_SECBTDEVMD_Pos)               /*!< SYS_T::PWRON: SECBTDEVMD Mask          */

#define SYS_PWRON_PWRONSRC_Pos           (15)                                              /*!< SYS_T::PWRON: PWRONSRC Position        */
#define SYS_PWRON_PWRONSRC_Msk           (0x1ul << SYS_PWRON_PWRONSRC_Pos)                 /*!< SYS_T::PWRON: PWRONSRC Mask            */

