yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
#define SYS_PWRON_USBID_Pos              (16)                                              /*!< SYS_T::PWRON: USBID Position           */
#define SYS_PWRON_USBID_Msk              (0x1ul << SYS_PWRON_USBID_Pos)                    /*!< SYS_T::PWRON: USBID Mask               */

#define SYS_PWRON_BTDELAY_Pos            (28)                                              /*!< SYS_T::PWRON: BTDELAY Position         */
#define SYS_PWRON_BTDELAY_Msk            (0xful << SYS_PWRON_BTDELAY_Pos)                  /*!< SYS_T::PWRON: BTDELAY Mask             */

#define SYS_LVRDCR_LVR_EN_Pos            (0)                                               /*!< SYS_T::LVRDCR: LVR_EN Position         */
#define SYS_LVRDCR_LVR_EN_Msk            (0x1ul << SYS_LVRDCR_LVR_EN_Pos)                  /*!< SYS_T::LVRDCR: LVR_EN Mask             */

#define SYS_LVRDCR_LVD_EN_Pos            (8)                                               /*!< SYS_T::LVRDCR: LVD_EN Position         */
#define SYS_LVRDCR_LVD_EN_Msk            (0x1ul << SYS_LVRDCR_LVD_EN_Pos)                  /*!< SYS_T::LVRDCR: LVD_EN Mask             */

#define SYS_LVRDCR_LVD_SEL_Pos           (9)                                               /*!< SYS_T::LVRDCR: LVD_SEL Position        */
#define SYS_LVRDCR_LVD_SEL_Msk           (0x1ul << SYS_LVRDCR_LVD_SEL_Pos)                 /*!< SYS_T::LVRDCR: LVD_SEL Mask            */

#define SYS_MISCFCR_IBRACCEN_Pos         (4)                                               /*!< SYS_T::MISCFCR: IBRACCEN Position      */
#define SYS_MISCFCR_IBRACCEN_Msk         (0x1ul << SYS_MISCFCR_IBRACCEN_Pos)               /*!< SYS_T::MISCFCR: IBRACCEN Mask          */

#define SYS_MISCFCR_BOOTISRC_Pos         (5)                                               /*!< SYS_T::MISCFCR: BOOTISRC Position      */
#define SYS_MISCFCR_BOOTISRC_Msk         (0x1ul << SYS_MISCFCR_BOOTISRC_Pos)               /*!< SYS_T::MISCFCR: BOOTISRC Mask          */

#define SYS_MISCFCR_WDTRSTEN_Pos         (8)                                               /*!< SYS_T::MISCFCR: WDTRSTEN Position      */
#define SYS_MISCFCR_WDTRSTEN_Msk         (0x1ul << SYS_MISCFCR_WDTRSTEN_Pos)               /*!< SYS_T::MISCFCR: WDTRSTEN Mask          */

#define SYS_MISCFCR_HDSPUEN_Pos          (9)                                               /*!< SYS_T::MISCFCR: HDSPUEN Position       */
#define SYS_MISCFCR_HDSPUEN_Msk          (0x1ul << SYS_MISCFCR_HDSPUEN_Pos)                /*!< SYS_T::MISCFCR: HDSPUEN Mask           */

#define SYS_MISCFCR_EADCFUNCEN_Pos       (10)                                              /*!< SYS_T::MISCFCR: EADCFUNCEN Position    */
#define SYS_MISCFCR_EADCFUNCEN_Msk       (0x1ul << SYS_MISCFCR_EADCFUNCEN_Pos)             /*!< SYS_T::MISCFCR: EADCFUNCEN Mask        */

#define SYS_MISCFCR_USRHDSEN_Pos         (11)                                              /*!< SYS_T::MISCFCR: USRHDSEN Position      */
#define SYS_MISCFCR_USRHDSEN_Msk         (0x1ul << SYS_MISCFCR_USRHDSEN_Pos)               /*!< SYS_T::MISCFCR: USRHDSEN Mask          */

#define SYS_MISCFCR_GPIOLBEN_Pos         (12)                                              /*!< SYS_T::MISCFCR: GPIOLBEN Position      */
#define SYS_MISCFCR_GPIOLBEN_Msk         (0x1ul << SYS_MISCFCR_GPIOLBEN_Pos)               /*!< SYS_T::MISCFCR: GPIOLBEN Mask          */

#define SYS_MISCFCR_SELFTEST_Pos         (13)                                              /*!< SYS_T::MISCFCR: SELFTEST Position      */
#define SYS_MISCFCR_SELFTEST_Msk         (0x1ul << SYS_MISCFCR_SELFTEST_Pos)               /*!< SYS_T::MISCFCR: SELFTEST Mask          */

#define SYS_MISCIER_LVD_IEN_Pos          (0)                                               /*!< SYS_T::MISCIER: LVD_IEN Position       */
#define SYS_MISCIER_LVD_IEN_Msk          (0x1ul << SYS_MISCIER_LVD_IEN_Pos)                /*!< SYS_T::MISCIER: LVD_IEN Mask           */

#define SYS_MISCIER_USBIDC_IEN_Pos       (1)                                               /*!< SYS_T::MISCIER: USBIDC_IEN Position    */
#define SYS_MISCIER_USBIDC_IEN_Msk       (0x1ul << SYS_MISCIER_USBIDC_IEN_Pos)             /*!< SYS_T::MISCIER: USBIDC_IEN Mask        */

#define SYS_MISCISR_LVD_IS_Pos           (0)                                               /*!< SYS_T::MISCISR: LVD_IS Position        */
#define SYS_MISCISR_LVD_IS_Msk           (0x1ul << SYS_MISCISR_LVD_IS_Pos)                 /*!< SYS_T::MISCISR: LVD_IS Mask            */

#define SYS_MISCISR_USBIDC_IS_Pos        (1)                                               /*!< SYS_T::MISCISR: USBIDC_IS Position     */
#define SYS_MISCISR_USBIDC_IS_Msk        (0x1ul << SYS_MISCISR_USBIDC_IS_Pos)              /*!< SYS_T::MISCISR: USBIDC_IS Mask         */

#define SYS_MISCISR_USB0_IDS_Pos         (17)                                              /*!< SYS_T::MISCISR: USB0_IDS Position      */
#define SYS_MISCISR_USB0_IDS_Msk         (0x1ul << SYS_MISCISR_USB0_IDS_Pos)               /*!< SYS_T::MISCISR: USB0_IDS Mask          */

#define SYS_AHBIPRST_CHIPRST_Pos         (0)                                               /*!< SYS_T::AHBIPRST: CHIPRST Position      */
#define SYS_AHBIPRST_CHIPRST_Msk         (0x1ul << SYS_AHBIPRST_CHIPRST_Pos)               /*!< SYS_T::AHBIPRST: CHIPRST Mask          */

#define SYS_AHBIPRST_CPURST_Pos          (2)                                               /*!< SYS_T::AHBIPRST: CPURST Position       */
#define SYS_AHBIPRST_CPURST_Msk          (0x1ul << SYS_AHBIPRST_CPURST_Pos)                /*!< SYS_T::AHBIPRST: CPURST Mask           */

#define SYS_AHBIPRST_EBIRST_Pos          (3)                                               /*!< SYS_T::AHBIPRST: EBIRST Position       */
#define SYS_AHBIPRST_EBIRST_Msk          (0x1ul << SYS_AHBIPRST_EBIRST_Pos)                /*!< SYS_T::AHBIPRST: EBIRST Mask           */

#define SYS_AHBIPRST_PDMA0RST_Pos        (4)                                               /*!< SYS_T::AHBIPRST: PDMA0RST Position     */
#define SYS_AHBIPRST_PDMA0RST_Msk        (0x1ul << SYS_AHBIPRST_PDMA0RST_Pos)              /*!< SYS_T::AHBIPRST: PDMA0RST Mask         */

#define SYS_AHBIPRST_PDMA1RST_Pos        (5)                                               /*!< SYS_T::AHBIPRST: PDMA1RST Position     */
#define SYS_AHBIPRST_PDMA1RST_Msk        (0x1ul << SYS_AHBIPRST_PDMA1RST_Pos)              /*!< SYS_T::AHBIPRST: PDMA1RST Mask         */

#define SYS_AHBIPRST_SDICRST_Pos         (6)                                               /*!< SYS_T::AHBIPRST: SDICRST Position      */
#define SYS_AHBIPRST_SDICRST_Msk         (0x1ul << SYS_AHBIPRST_SDICRST_Pos)               /*!< SYS_T::AHBIPRST: SDICRST Mask          */

#define SYS_AHBIPRST_GPIORST_Pos         (7)                                               /*!< SYS_T::AHBIPRST: GPIORST Position      */
#define SYS_AHBIPRST_GPIORST_Msk         (0x1ul << SYS_AHBIPRST_GPIORST_Pos)               /*!< SYS_T::AHBIPRST: GPIORST Mask          */

#define SYS_AHBIPRST_I2SRST_Pos          (8)                                               /*!< SYS_T::AHBIPRST: I2SRST Position       */
#define SYS_AHBIPRST_I2SRST_Msk          (0x1ul << SYS_AHBIPRST_I2SRST_Pos)                /*!< SYS_T::AHBIPRST: I2SRST Mask           */

