yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
#define SYS_AHBIPRST_EMAC0RST_Pos        (16)                                              /*!< SYS_T::AHBIPRST: EMAC0RST Position     */
#define SYS_AHBIPRST_EMAC0RST_Msk        (0x1ul << SYS_AHBIPRST_EMAC0RST_Pos)              /*!< SYS_T::AHBIPRST: EMAC0RST Mask         */

#define SYS_AHBIPRST_EMAC1RST_Pos        (17)                                              /*!< SYS_T::AHBIPRST: EMAC1RST Position     */
#define SYS_AHBIPRST_EMAC1RST_Msk        (0x1ul << SYS_AHBIPRST_EMAC1RST_Pos)              /*!< SYS_T::AHBIPRST: EMAC1RST Mask         */

#define SYS_AHBIPRST_HSUSBHRST_Pos       (18)                                              /*!< SYS_T::AHBIPRST: HSUSBHRST Position    */
#define SYS_AHBIPRST_HSUSBHRST_Msk       (0x1ul << SYS_AHBIPRST_HSUSBHRST_Pos)             /*!< SYS_T::AHBIPRST: HSUSBHRST Mask        */

#define SYS_AHBIPRST_HSUSBDRST_Pos       (19)                                              /*!< SYS_T::AHBIPRST: HSUSBDRST Position    */
#define SYS_AHBIPRST_HSUSBDRST_Msk       (0x1ul << SYS_AHBIPRST_HSUSBDRST_Pos)             /*!< SYS_T::AHBIPRST: HSUSBDRST Mask        */

#define SYS_AHBIPRST_NDNDRST_Pos         (20)                                              /*!< SYS_T::AHBIPRST: NDNDRST Position      */
#define SYS_AHBIPRST_NDNDRST_Msk         (0x1ul << SYS_AHBIPRST_NDNDRST_Pos)               /*!< SYS_T::AHBIPRST: NDNDRST Mask          */

#define SYS_AHBIPRST_KSRST_Pos           (21)                                              /*!< SYS_T::AHBIPRST: KSRST Position        */
#define SYS_AHBIPRST_KSRST_Msk           (0x1ul << SYS_AHBIPRST_KSRST_Pos)                 /*!< SYS_T::AHBIPRST: KSRST Mask            */

#define SYS_AHBIPRST_OTPRST_Pos          (22)                                              /*!< SYS_T::AHBIPRST: OTPRST Position       */
#define SYS_AHBIPRST_OTPRST_Msk          (0x1ul << SYS_AHBIPRST_OTPRST_Pos)                /*!< SYS_T::AHBIPRST: OTPRST Mask           */

#define SYS_AHBIPRST_CRYPTORST_Pos       (23)                                              /*!< SYS_T::AHBIPRST: CRYPTORST Position    */
#define SYS_AHBIPRST_CRYPTORST_Msk       (0x1ul << SYS_AHBIPRST_CRYPTORST_Pos)             /*!< SYS_T::AHBIPRST: CRYPTORST Mask        */

#define SYS_AHBIPRST_SDH0RST_Pos         (24)                                              /*!< SYS_T::AHBIPRST: SDH0RST Position      */
#define SYS_AHBIPRST_SDH0RST_Msk         (0x1ul << SYS_AHBIPRST_SDH0RST_Pos)               /*!< SYS_T::AHBIPRST: SDH0RST Mask          */

#define SYS_AHBIPRST_SDH1RST_Pos         (25)                                              /*!< SYS_T::AHBIPRST: SDH1RST Position      */
#define SYS_AHBIPRST_SDH1RST_Msk         (0x1ul << SYS_AHBIPRST_SDH1RST_Pos)               /*!< SYS_T::AHBIPRST: SDH1RST Mask          */

#define SYS_AHBIPRST_CANFD0RST_Pos       (28)                                              /*!< SYS_T::AHBIPRST: CANFD0RST Position    */
#define SYS_AHBIPRST_CANFD0RST_Msk       (0x1ul << SYS_AHBIPRST_CANFD0RST_Pos)             /*!< SYS_T::AHBIPRST: CANFD0RST Mask        */

#define SYS_AHBIPRST_CANFD1RST_Pos       (29)                                              /*!< SYS_T::AHBIPRST: CANFD1RST Position    */
#define SYS_AHBIPRST_CANFD1RST_Msk       (0x1ul << SYS_AHBIPRST_CANFD1RST_Pos)             /*!< SYS_T::AHBIPRST: CANFD1RST Mask        */

#define SYS_AHBIPRST_CANFD2RST_Pos       (30)                                              /*!< SYS_T::AHBIPRST: CANFD2RST Position    */
#define SYS_AHBIPRST_CANFD2RST_Msk       (0x1ul << SYS_AHBIPRST_CANFD2RST_Pos)             /*!< SYS_T::AHBIPRST: CANFD2RST Mask        */

#define SYS_AHBIPRST_CANFD3RST_Pos       (31)                                              /*!< SYS_T::AHBIPRST: CANFD3RST Position    */
#define SYS_AHBIPRST_CANFD3RST_Msk       (0x1ul << SYS_AHBIPRST_CANFD3RST_Pos)             /*!< SYS_T::AHBIPRST: CANFD3RST Mask        */

#define SYS_APBIPRST0_TIMER3RST_Pos      (11)                                              /*!< SYS_T::APBIPRST0: TIMER3RST Position   */
#define SYS_APBIPRST0_TIMER3RST_Msk      (0x1ul << SYS_APBIPRST0_TIMER3RST_Pos)            /*!< SYS_T::APBIPRST0: TIMER3RST Mask       */

#define SYS_APBIPRST0_TIMER4RST_Pos      (12)                                              /*!< SYS_T::APBIPRST0: TIMER4RST Position   */
#define SYS_APBIPRST0_TIMER4RST_Msk      (0x1ul << SYS_APBIPRST0_TIMER4RST_Pos)            /*!< SYS_T::APBIPRST0: TIMER4RST Mask       */

#define SYS_APBIPRST0_TIMER5RST_Pos      (13)                                              /*!< SYS_T::APBIPRST0: TIMER5RST Position   */
#define SYS_APBIPRST0_TIMER5RST_Msk      (0x1ul << SYS_APBIPRST0_TIMER5RST_Pos)            /*!< SYS_T::APBIPRST0: TIMER5RST Mask       */

#define SYS_APBIPRST0_UART0RST_Pos       (16)                                              /*!< SYS_T::APBIPRST0: UART0RST Position    */
#define SYS_APBIPRST0_UART0RST_Msk       (0x1ul << SYS_APBIPRST0_UART0RST_Pos)             /*!< SYS_T::APBIPRST0: UART0RST Mask        */

#define SYS_APBIPRST0_UART1RST_Pos       (17)                                              /*!< SYS_T::APBIPRST0: UART1RST Position    */
#define SYS_APBIPRST0_UART1RST_Msk       (0x1ul << SYS_APBIPRST0_UART1RST_Pos)             /*!< SYS_T::APBIPRST0: UART1RST Mask        */

#define SYS_APBIPRST0_UART2RST_Pos       (18)                                              /*!< SYS_T::APBIPRST0: UART2RST Position    */
#define SYS_APBIPRST0_UART2RST_Msk       (0x1ul << SYS_APBIPRST0_UART2RST_Pos)             /*!< SYS_T::APBIPRST0: UART2RST Mask        */

#define SYS_APBIPRST0_UART3RST_Pos       (19)                                              /*!< SYS_T::APBIPRST0: UART3RST Position    */
#define SYS_APBIPRST0_UART3RST_Msk       (0x1ul << SYS_APBIPRST0_UART3RST_Pos)             /*!< SYS_T::APBIPRST0: UART3RST Mask        */

#define SYS_APBIPRST0_UART4RST_Pos       (20)                                              /*!< SYS_T::APBIPRST0: UART4RST Position    */
#define SYS_APBIPRST0_UART4RST_Msk       (0x1ul << SYS_APBIPRST0_UART4RST_Pos)             /*!< SYS_T::APBIPRST0: UART4RST Mask        */

#define SYS_APBIPRST0_UART5RST_Pos       (21)                                              /*!< SYS_T::APBIPRST0: UART5RST Position    */
#define SYS_APBIPRST0_UART5RST_Msk       (0x1ul << SYS_APBIPRST0_UART5RST_Pos)             /*!< SYS_T::APBIPRST0: UART5RST Mask        */

#define SYS_APBIPRST0_UART6RST_Pos       (22)                                              /*!< SYS_T::APBIPRST0: UART6RST Position    */
#define SYS_APBIPRST0_UART6RST_Msk       (0x1ul << SYS_APBIPRST0_UART6RST_Pos)             /*!< SYS_T::APBIPRST0: UART6RST Mask        */

#define SYS_APBIPRST0_UART7RST_Pos       (23)                                              /*!< SYS_T::APBIPRST0: UART7RST Position    */
#define SYS_APBIPRST0_UART7RST_Msk       (0x1ul << SYS_APBIPRST0_UART7RST_Pos)             /*!< SYS_T::APBIPRST0: UART7RST Mask        */

#define SYS_APBIPRST0_UART8RST_Pos       (24)                                              /*!< SYS_T::APBIPRST0: UART8RST Position    */
#define SYS_APBIPRST0_UART8RST_Msk       (0x1ul << SYS_APBIPRST0_UART8RST_Pos)             /*!< SYS_T::APBIPRST0: UART8RST Mask        */

#define SYS_APBIPRST0_UART9RST_Pos       (25)                                              /*!< SYS_T::APBIPRST0: UART9RST Position    */
#define SYS_APBIPRST0_UART9RST_Msk       (0x1ul << SYS_APBIPRST0_UART9RST_Pos)             /*!< SYS_T::APBIPRST0: UART9RST Mask        */

#define SYS_APBIPRST1_I2C0RST_Pos        (0)                                               /*!< SYS_T::APBIPRST1: I2C0RST Position     */
#define SYS_APBIPRST1_I2C0RST_Msk        (0x1ul << SYS_APBIPRST1_I2C0RST_Pos)              /*!< SYS_T::APBIPRST1: I2C0RST Mask         */

#define SYS_APBIPRST1_I2C1RST_Pos        (1)                                               /*!< SYS_T::APBIPRST1: I2C1RST Position     */
#define SYS_APBIPRST1_I2C1RST_Msk        (0x1ul << SYS_APBIPRST1_I2C1RST_Pos)              /*!< SYS_T::APBIPRST1: I2C1RST Mask         */

#define SYS_APBIPRST1_I2C2RST_Pos        (2)                                               /*!< SYS_T::APBIPRST1: I2C2RST Position     */
#define SYS_APBIPRST1_I2C2RST_Msk        (0x1ul << SYS_APBIPRST1_I2C2RST_Pos)              /*!< SYS_T::APBIPRST1: I2C2RST Mask         */

