yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
#define SYS_APBIPRST1_I2C3RST_Pos        (3)                                               /*!< SYS_T::APBIPRST1: I2C3RST Position     */
#define SYS_APBIPRST1_I2C3RST_Msk        (0x1ul << SYS_APBIPRST1_I2C3RST_Pos)              /*!< SYS_T::APBIPRST1: I2C3RST Mask         */

#define SYS_APBIPRST1_SPI0RST_Pos        (4)                                               /*!< SYS_T::APBIPRST1: SPI0RST Position     */
#define SYS_APBIPRST1_SPI0RST_Msk        (0x1ul << SYS_APBIPRST1_SPI0RST_Pos)              /*!< SYS_T::APBIPRST1: SPI0RST Mask         */

#define SYS_APBIPRST1_SPI1RST_Pos        (5)                                               /*!< SYS_T::APBIPRST1: SPI1RST Position     */
#define SYS_APBIPRST1_SPI1RST_Msk        (0x1ul << SYS_APBIPRST1_SPI1RST_Pos)              /*!< SYS_T::APBIPRST1: SPI1RST Mask         */

#define SYS_APBIPRST1_SPI2RST_Pos        (6)                                               /*!< SYS_T::APBIPRST1: SPI2RST Position     */
#define SYS_APBIPRST1_SPI2RST_Msk        (0x1ul << SYS_APBIPRST1_SPI2RST_Pos)              /*!< SYS_T::APBIPRST1: SPI2RST Mask         */

#define SYS_APBIPRST1_SPI3RST_Pos        (7)                                               /*!< SYS_T::APBIPRST1: SPI3RST Position     */
#define SYS_APBIPRST1_SPI3RST_Msk        (0x1ul << SYS_APBIPRST1_SPI3RST_Pos)              /*!< SYS_T::APBIPRST1: SPI3RST Mask         */

#define SYS_APBIPRST1_CAN0RST_Pos        (8)                                               /*!< SYS_T::APBIPRST1: CAN0RST Position     */
#define SYS_APBIPRST1_CAN0RST_Msk        (0x1ul << SYS_APBIPRST1_CAN0RST_Pos)              /*!< SYS_T::APBIPRST1: CAN0RST Mask         */

#define SYS_APBIPRST1_CAN1RST_Pos        (9)                                               /*!< SYS_T::APBIPRST1: CAN1RST Position     */
#define SYS_APBIPRST1_CAN1RST_Msk        (0x1ul << SYS_APBIPRST1_CAN1RST_Pos)              /*!< SYS_T::APBIPRST1: CAN1RST Mask         */

#define SYS_APBIPRST1_CAN2RST_Pos        (10)                                              /*!< SYS_T::APBIPRST1: CAN2RST Position     */
#define SYS_APBIPRST1_CAN2RST_Msk        (0x1ul << SYS_APBIPRST1_CAN2RST_Pos)              /*!< SYS_T::APBIPRST1: CAN2RST Mask         */

#define SYS_APBIPRST1_CAN3RST_Pos        (11)                                              /*!< SYS_T::APBIPRST1: CAN3RST Position     */
#define SYS_APBIPRST1_CAN3RST_Msk        (0x1ul << SYS_APBIPRST1_CAN3RST_Pos)              /*!< SYS_T::APBIPRST1: CAN3RST Mask         */

#define SYS_APBIPRST1_ADCRST_Pos         (24)                                              /*!< SYS_T::APBIPRST1: ADCRST Position      */
#define SYS_APBIPRST1_ADCRST_Msk         (0x1ul << SYS_APBIPRST1_ADCRST_Pos)               /*!< SYS_T::APBIPRST1: ADCRST Mask          */

#define SYS_APBIPRST1_EADCRST_Pos        (25)                                              /*!< SYS_T::APBIPRST1: EADCRST Position     */
#define SYS_APBIPRST1_EADCRST_Msk        (0x1ul << SYS_APBIPRST1_EADCRST_Pos)              /*!< SYS_T::APBIPRST1: EADCRST Mask         */

#define SYS_APBIPRST1_BPWM0RST_Pos       (26)                                              /*!< SYS_T::APBIPRST1: BPWM0RST Position    */
#define SYS_APBIPRST1_BPWM0RST_Msk       (0x1ul << SYS_APBIPRST1_BPWM0RST_Pos)             /*!< SYS_T::APBIPRST1: BPWM0RST Mask        */

#define SYS_APBIPRST1_BPWM1RST_Pos       (27)                                              /*!< SYS_T::APBIPRST1: BPWM1RST Position    */
#define SYS_APBIPRST1_BPWM1RST_Msk       (0x1ul << SYS_APBIPRST1_BPWM1RST_Pos)             /*!< SYS_T::APBIPRST1: BPWM1RST Mask        */

#define SYS_APBIPRST1_SMC0RST_Pos        (30)                                              /*!< SYS_T::APBIPRST1: SMC0RST Position     */
#define SYS_APBIPRST1_SMC0RST_Msk        (0x1ul << SYS_APBIPRST1_SMC0RST_Pos)              /*!< SYS_T::APBIPRST1: SMC0RST Mask         */

#define SYS_APBIPRST1_SMC1RST_Pos        (31)                                              /*!< SYS_T::APBIPRST1: SMC1RST Position     */
#define SYS_APBIPRST1_SMC1RST_Msk        (0x1ul << SYS_APBIPRST1_SMC1RST_Pos)              /*!< SYS_T::APBIPRST1: SMC1RST Mask         */

#define SYS_RSTSTS_PORRSTS_Pos           (0)                                               /*!< SYS_T::RSTSTS: PORRSTS Position        */
#define SYS_RSTSTS_PORRSTS_Msk           (0x1ul << SYS_RSTSTS_PORRSTS_Pos)                 /*!< SYS_T::RSTSTS: PORRSTS Mask            */

#define SYS_RSTSTS_PINRSTS_Pos           (1)                                               /*!< SYS_T::RSTSTS: PINRSTS Position        */
#define SYS_RSTSTS_PINRSTS_Msk           (0x1ul << SYS_RSTSTS_PINRSTS_Pos)                 /*!< SYS_T::RSTSTS: PINRSTS Mask            */

#define SYS_RSTSTS_LVRRSTS_Pos           (2)                                               /*!< SYS_T::RSTSTS: LVRRSTS Position        */
#define SYS_RSTSTS_LVRRSTS_Msk           (0x1ul << SYS_RSTSTS_LVRRSTS_Pos)                 /*!< SYS_T::RSTSTS: LVRRSTS Mask            */

#define SYS_RSTSTS_CHIPRSTS_Pos          (3)                                               /*!< SYS_T::RSTSTS: CHIPRSTS Position       */
#define SYS_RSTSTS_CHIPRSTS_Msk          (0x1ul << SYS_RSTSTS_CHIPRSTS_Pos)                /*!< SYS_T::RSTSTS: CHIPRSTS Mask           */

#define SYS_RSTSTS_CPURSTS_Pos           (4)                                               /*!< SYS_T::RSTSTS: CPURSTS Position        */
#define SYS_RSTSTS_CPURSTS_Msk           (0x1ul << SYS_RSTSTS_CPURSTS_Pos)                 /*!< SYS_T::RSTSTS: CPURSTS Mask            */

#define SYS_RSTSTS_WDTRSTS_Pos           (5)                                               /*!< SYS_T::RSTSTS: WDTRSTS Position        */
#define SYS_RSTSTS_WDTRSTS_Msk           (0x1ul << SYS_RSTSTS_WDTRSTS_Pos)                 /*!< SYS_T::RSTSTS: WDTRSTS Mask            */

#define SYS_RSTSTS_WWDTRSTS_Pos          (6)                                               /*!< SYS_T::RSTSTS: WWDTRSTS Position       */
#define SYS_RSTSTS_WWDTRSTS_Msk          (0x1ul << SYS_RSTSTS_WWDTRSTS_Pos)                /*!< SYS_T::RSTSTS: WWDTRSTS Mask           */

#define SYS_GPA_MFPL_PA0MFP_Pos          (0)                                               /*!< SYS_T::GPA_MFPL: MFP_GPA0 Position     */
#define SYS_GPA_MFPL_PA0MFP_Msk          (0xful << SYS_GPA_MFPL_PA0MFP_Pos)                /*!< SYS_T::GPA_MFPL: MFP_GPA0 Mask         */

#define SYS_GPA_MFPL_PA1MFP_Pos          (4)                                               /*!< SYS_T::GPA_MFPL: MFP_GPA1 Position     */
#define SYS_GPA_MFPL_PA1MFP_Msk          (0xful << SYS_GPA_MFPL_PA1MFP_Pos)                /*!< SYS_T::GPA_MFPL: MFP_GPA1 Mask         */

#define SYS_GPA_MFPL_PA2MFP_Pos          (8)                                               /*!< SYS_T::GPA_MFPL: MFP_GPA2 Position     */
#define SYS_GPA_MFPL_PA2MFP_Msk          (0xful << SYS_GPA_MFPL_PA2MFP_Pos)                /*!< SYS_T::GPA_MFPL: MFP_GPA2 Mask         */

