yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
#define SYS_GPG_MFPH_PG15MFP_Pos         (28)                                              /*!< SYS_T::GPG_MFPH: MFP_GPG15 Position    */
#define SYS_GPG_MFPH_PG15MFP_Msk         (0xful << SYS_GPG_MFPH_PG15MFP_Pos)               /*!< SYS_T::GPG_MFPH: MFP_GPG15 Mask        */

#define SYS_GPH_MFPL_PH0MFP_Pos          (0)                                               /*!< SYS_T::GPH_MFPL: MFP_GPH0 Position     */
#define SYS_GPH_MFPL_PH0MFP_Msk          (0xful << SYS_GPH_MFPL_PH0MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH0 Mask         */

#define SYS_GPH_MFPL_PH1MFP_Pos          (4)                                               /*!< SYS_T::GPH_MFPL: MFP_GPH1 Position     */
#define SYS_GPH_MFPL_PH1MFP_Msk          (0xful << SYS_GPH_MFPL_PH1MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH1 Mask         */

#define SYS_GPH_MFPL_PH2MFP_Pos          (8)                                               /*!< SYS_T::GPH_MFPL: MFP_GPH2 Position     */
#define SYS_GPH_MFPL_PH2MFP_Msk          (0xful << SYS_GPH_MFPL_PH2MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH2 Mask         */

#define SYS_GPH_MFPL_PH3MFP_Pos          (12)                                              /*!< SYS_T::GPH_MFPL: MFP_GPH3 Position     */
#define SYS_GPH_MFPL_PH3MFP_Msk          (0xful << SYS_GPH_MFPL_PH3MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH3 Mask         */

#define SYS_GPH_MFPL_PH4MFP_Pos          (16)                                              /*!< SYS_T::GPH_MFPL: MFP_GPH4 Position     */
#define SYS_GPH_MFPL_PH4MFP_Msk          (0xful << SYS_GPH_MFPL_PH4MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH4 Mask         */

#define SYS_GPH_MFPL_PH5MFP_Pos          (20)                                              /*!< SYS_T::GPH_MFPL: MFP_GPH5 Position     */
#define SYS_GPH_MFPL_PH5MFP_Msk          (0xful << SYS_GPH_MFPL_PH5MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH5 Mask         */

#define SYS_GPH_MFPL_PH6MFP_Pos          (24)                                              /*!< SYS_T::GPH_MFPL: MFP_GPH6 Position     */
#define SYS_GPH_MFPL_PH6MFP_Msk          (0xful << SYS_GPH_MFPL_PH6MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH6 Mask         */

#define SYS_GPH_MFPL_PH7MFP_Pos          (28)                                              /*!< SYS_T::GPH_MFPL: MFP_GPH7 Position     */
#define SYS_GPH_MFPL_PH7MFP_Msk          (0xful << SYS_GPH_MFPL_PH7MFP_Pos)                /*!< SYS_T::GPH_MFPL: MFP_GPH7 Mask         */

#define SYS_GPH_MFPH_PH8MFP_Pos          (0)                                               /*!< SYS_T::GPH_MFPH: MFP_GPH8 Position     */
#define SYS_GPH_MFPH_PH8MFP_Msk          (0xful << SYS_GPH_MFPH_PH8MFP_Pos)                /*!< SYS_T::GPH_MFPH: MFP_GPH8 Mask         */

#define SYS_GPH_MFPH_PH9MFP_Pos          (4)                                               /*!< SYS_T::GPH_MFPH: MFP_GPH9 Position     */
#define SYS_GPH_MFPH_PH9MFP_Msk          (0xful << SYS_GPH_MFPH_PH9MFP_Pos)                /*!< SYS_T::GPH_MFPH: MFP_GPH9 Mask         */

#define SYS_DDR_DSCTL_CLK_DS_Pos         (0)                                               /*!< SYS_T::DDR_DSCTL: CLK_DS Position      */
#define SYS_DDR_DSCTL_CLK_DS_Msk         (0x3ul << SYS_DDR_DSCTL_CLK_DS_Pos)               /*!< SYS_T::DDR_DSCTL: CLK_DS Mask          */

#define SYS_DDR_DSCTL_CTRL_DS_Pos        (2)                                               /*!< SYS_T::DDR_DSCTL: CTRL_DS Position     */
#define SYS_DDR_DSCTL_CTRL_DS_Msk        (0x3ul << SYS_DDR_DSCTL_CTRL_DS_Pos)              /*!< SYS_T::DDR_DSCTL: CTRL_DS Mask         */

#define SYS_DDR_DSCTL_ADDR_DS_Pos        (4)                                               /*!< SYS_T::DDR_DSCTL: ADDR_DS Position     */
#define SYS_DDR_DSCTL_ADDR_DS_Msk        (0x3ul << SYS_DDR_DSCTL_ADDR_DS_Pos)              /*!< SYS_T::DDR_DSCTL: ADDR_DS Mask         */

#define SYS_DDR_DSCTL_DATA_DS_Pos        (6)                                               /*!< SYS_T::DDR_DSCTL: DATA_DS Position     */
#define SYS_DDR_DSCTL_DATA_DS_Msk        (0x3ul << SYS_DDR_DSCTL_DATA_DS_Pos)              /*!< SYS_T::DDR_DSCTL: DATA_DS Mask         */

#define SYS_GPBL_DSCTL_DS_GPB0_Pos       (0)                                               /*!< SYS_T::GPBL_DSCTL: DS_GPB0 Position    */
#define SYS_GPBL_DSCTL_DS_GPB0_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB0_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB0 Mask        */

#define SYS_GPBL_DSCTL_DS_GPB1_Pos       (4)                                               /*!< SYS_T::GPBL_DSCTL: DS_GPB1 Position    */
#define SYS_GPBL_DSCTL_DS_GPB1_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB1_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB1 Mask        */

#define SYS_GPBL_DSCTL_DS_GPB2_Pos       (8)                                               /*!< SYS_T::GPBL_DSCTL: DS_GPB2 Position    */
#define SYS_GPBL_DSCTL_DS_GPB2_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB2_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB2 Mask        */

#define SYS_GPBL_DSCTL_DS_GPB3_Pos       (12)                                              /*!< SYS_T::GPBL_DSCTL: DS_GPB3 Position    */
#define SYS_GPBL_DSCTL_DS_GPB3_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB3_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB3 Mask        */

#define SYS_GPBL_DSCTL_DS_GPB4_Pos       (16)                                              /*!< SYS_T::GPBL_DSCTL: DS_GPB4 Position    */
#define SYS_GPBL_DSCTL_DS_GPB4_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB4_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB4 Mask        */

#define SYS_GPBL_DSCTL_DS_GPB5_Pos       (20)                                              /*!< SYS_T::GPBL_DSCTL: DS_GPB5 Position    */
#define SYS_GPBL_DSCTL_DS_GPB5_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB5_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB5 Mask        */

#define SYS_GPBL_DSCTL_DS_GPB6_Pos       (24)                                              /*!< SYS_T::GPBL_DSCTL: DS_GPB6 Position    */
#define SYS_GPBL_DSCTL_DS_GPB6_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB6_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB6 Mask        */

#define SYS_GPBL_DSCTL_DS_GPB7_Pos       (28)                                              /*!< SYS_T::GPBL_DSCTL: DS_GPB7 Position    */
#define SYS_GPBL_DSCTL_DS_GPB7_Msk       (0xful << SYS_GPBL_DSCTL_DS_GPB7_Pos)             /*!< SYS_T::GPBL_DSCTL: DS_GPB7 Mask        */

#define SYS_PORDISCR_POR_DIS_CODE_Pos    (0)                                               /*!< SYS_T::PORDISCR: POR_DIS_CODE Position */
#define SYS_PORDISCR_POR_DIS_CODE_Msk    (0xfffful << SYS_PORDISCR_POR_DIS_CODE_Pos)       /*!< SYS_T::PORDISCR: POR_DIS_CODE Mask     */

