yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
#define SYS_RSTDEBCTL_DEBCNT_Pos         (0)                                               /*!< SYS_T::RSTDEBCTL: DEBCNT Position      */
#define SYS_RSTDEBCTL_DEBCNT_Msk         (0xfffful << SYS_RSTDEBCTL_DEBCNT_Pos)            /*!< SYS_T::RSTDEBCTL: DEBCNT Mask          */

#define SYS_RSTDEBCTL_RSTDEBEN_Pos       (31)                                              /*!< SYS_T::RSTDEBCTL: RSTDEBEN Position    */
#define SYS_RSTDEBCTL_RSTDEBEN_Msk       (0x1ul << SYS_RSTDEBCTL_RSTDEBEN_Pos)             /*!< SYS_T::RSTDEBCTL: RSTDEBEN Mask        */

#define SYS_MACAD0LSR_MACADRLSR_Pos      (0)                                               /*!< SYS_T::MACAD0LSR: MACADRLSR Position   */
#define SYS_MACAD0LSR_MACADRLSR_Msk      (0xfffffffful << SYS_MACAD0LSR_MACADRLSR_Pos)     /*!< SYS_T::MACAD0LSR: MACADRLSR Mask       */

#define SYS_MACAD0HSR_MACADRHSR_Pos      (0)                                               /*!< SYS_T::MACAD0HSR: MACADRHSR Position   */
#define SYS_MACAD0HSR_MACADRHSR_Msk      (0xfffful << SYS_MACAD0HSR_MACADRHSR_Pos)         /*!< SYS_T::MACAD0HSR: MACADRHSR Mask       */

#define SYS_MACAD1LSR_MACADRLSR_Pos      (0)                                               /*!< SYS_T::MACAD1LSR: MACADRLSR Position   */
#define SYS_MACAD1LSR_MACADRLSR_Msk      (0xfffffffful << SYS_MACAD1LSR_MACADRLSR_Pos)     /*!< SYS_T::MACAD1LSR: MACADRLSR Mask       */

#define SYS_MACAD1HSR_MACADRHSR_Pos      (0)                                               /*!< SYS_T::MACAD1HSR: MACADRHSR Position   */
#define SYS_MACAD1HSR_MACADRHSR_Msk      (0xfffful << SYS_MACAD1HSR_MACADRHSR_Pos)         /*!< SYS_T::MACAD1HSR: MACADRHSR Mask       */

#define SYS_UID0_UID_Pos                 (0)                                               /*!< SYS_T::UID0: UID Position              */
#define SYS_UID0_UID_Msk                 (0xfffffffful << SYS_UID0_UID_Pos)                /*!< SYS_T::UID0: UID Mask                  */

#define SYS_UID1_UID_Pos                 (0)                                               /*!< SYS_T::UID1: UID Position              */
#define SYS_UID1_UID_Msk                 (0xfffffffful << SYS_UID1_UID_Pos)                /*!< SYS_T::UID1: UID Mask                  */

#define SYS_UID2_UID_Pos                 (0)                                               /*!< SYS_T::UID2: UID Position              */
#define SYS_UID2_UID_Msk                 (0xfffffffful << SYS_UID2_UID_Pos)                /*!< SYS_T::UID2: UID Mask                  */

#define SYS_UCID0_UCID_Pos               (0)                                               /*!< SYS_T::UCID0: UCID Position            */
#define SYS_UCID0_UCID_Msk               (0xfffffffful << SYS_UCID0_UCID_Pos)              /*!< SYS_T::UCID0: UCID Mask                */

#define SYS_UCID1_UCID_Pos               (0)                                               /*!< SYS_T::UCID1: UCID Position            */
#define SYS_UCID1_UCID_Msk               (0xfffffffful << SYS_UCID1_UCID_Pos)              /*!< SYS_T::UCID1: UCID Mask                */

#define SYS_UCID2_UCID_Pos               (0)                                               /*!< SYS_T::UCID2: UCID Position            */
#define SYS_UCID2_UCID_Msk               (0xfffffffful << SYS_UCID2_UCID_Pos)              /*!< SYS_T::UCID2: UCID Mask                */

#define SYS_REGLKCTL_REGLCTL_Pos         (0)                                               /*!< SYS_T::REGLKCTL: REGLCTL Position      */
#define SYS_REGLKCTL_REGLCTL_Msk         (0xfful << SYS_REGLKCTL_REGLCTL_Pos)              /*!< SYS_T::REGLKCTL: REGLCTL Mask          */

#define SYS_DPLPASWD_DPLPASWD_Pos        (0)                                               /*!< SYS_T::DPLPASWD: DPLPASWD Position     */
#define SYS_DPLPASWD_DPLPASWD_Msk        (0xfffffffful << SYS_DPLPASWD_DPLPASWD_Pos)       /*!< SYS_T::DPLPASWD: DPLPASWD Mask         */

#define SYS_OTPCHKER_OTPCHKER_Pos        (0)                                               /*!< SYS_T::OTPCHKER: OTPCHKER Position     */
#define SYS_OTPCHKER_OTPCHKER_Msk        (0xfffffffful << SYS_OTPCHKER_OTPCHKER_Pos)       /*!< SYS_T::OTPCHKER: OTPCHKER Mask         */

#define SYS_PLMSTS_STAGE_Pos             (0)                                               /*!< SYS_T::PLMSTS: STAGE Position          */
#define SYS_PLMSTS_STAGE_Msk             (0x7ul << SYS_PLMSTS_STAGE_Pos)                   /*!< SYS_T::PLMSTS: STAGE Mask              */

#define SYS_PLMSTS_RVCODE_Pos            (24)                                              /*!< SYS_T::PLMSTS: RVCODE Position         */
#define SYS_PLMSTS_RVCODE_Msk            (0xfful << SYS_PLMSTS_RVCODE_Pos)                 /*!< SYS_T::PLMSTS: RVCODE Mask             */

#define SYS_PNUMREVR_PRDNUML1_Pos        (0)                                               /*!< SYS_T::PNUMREVR: PRDNUML1 Position     */
#define SYS_PNUMREVR_PRDNUML1_Msk        (0xful << SYS_PNUMREVR_PRDNUML1_Pos)              /*!< SYS_T::PNUMREVR: PRDNUML1 Mask         */

#define SYS_PNUMREVR_PRDNUML2_Pos        (4)                                               /*!< SYS_T::PNUMREVR: PRDNUML2 Position     */
#define SYS_PNUMREVR_PRDNUML2_Msk        (0xful << SYS_PNUMREVR_PRDNUML2_Pos)              /*!< SYS_T::PNUMREVR: PRDNUML2 Mask         */

#define SYS_PNUMREVR_PRDNUML3_Pos        (8)                                               /*!< SYS_T::PNUMREVR: PRDNUML3 Position     */
#define SYS_PNUMREVR_PRDNUML3_Msk        (0xful << SYS_PNUMREVR_PRDNUML3_Pos)              /*!< SYS_T::PNUMREVR: PRDNUML3 Mask         */

#define SYS_PNUMREVR_PRDNUML4_Pos        (12)                                              /*!< SYS_T::PNUMREVR: PRDNUML4 Position     */
#define SYS_PNUMREVR_PRDNUML4_Msk        (0xful << SYS_PNUMREVR_PRDNUML4_Pos)              /*!< SYS_T::PNUMREVR: PRDNUML4 Mask         */

#define SYS_PNUMREVR_PRDNUML5_Pos        (16)                                              /*!< SYS_T::PNUMREVR: PRDNUML5 Position     */
#define SYS_PNUMREVR_PRDNUML5_Msk        (0xful << SYS_PNUMREVR_PRDNUML5_Pos)              /*!< SYS_T::PNUMREVR: PRDNUML5 Mask         */

