yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/sys_reg.h
#define SYS_PNUMREVR_PRDNUML6_Pos        (20)                                              /*!< SYS_T::PNUMREVR: PRDNUML6 Position     */
#define SYS_PNUMREVR_PRDNUML6_Msk        (0xful << SYS_PNUMREVR_PRDNUML6_Pos)              /*!< SYS_T::PNUMREVR: PRDNUML6 Mask         */

#define SYS_PNUMREVR_REV_Pos             (24)                                              /*!< SYS_T::PNUMREVR: REV Position          */
#define SYS_PNUMREVR_REV_Msk             (0xful << SYS_PNUMREVR_REV_Pos)                   /*!< SYS_T::PNUMREVR: REV Mask              */

#define SYS_PNUMREVR_Foundry_Pos         (28)                                              /*!< SYS_T::PNUMREVR: Foundry Position      */
#define SYS_PNUMREVR_Foundry_Msk         (0xful << SYS_PNUMREVR_Foundry_Pos)               /*!< SYS_T::PNUMREVR: Foundry Mask          */

#define SYS_CHIPCFG_CANFD0DIS_Pos        (4)                                               /*!< SYS_T::CHIPCFG: CANFD0DIS Position     */
#define SYS_CHIPCFG_CANFD0DIS_Msk        (0x1ul << SYS_CHIPCFG_CANFD0DIS_Pos)              /*!< SYS_T::CHIPCFG: CANFD0DIS Mask         */

#define SYS_CHIPCFG_CANFD1DIS_Pos        (5)                                               /*!< SYS_T::CHIPCFG: CANFD1DIS Position     */
#define SYS_CHIPCFG_CANFD1DIS_Msk        (0x1ul << SYS_CHIPCFG_CANFD1DIS_Pos)              /*!< SYS_T::CHIPCFG: CANFD1DIS Mask         */

#define SYS_CHIPCFG_CANFD2DIS_Pos        (6)                                               /*!< SYS_T::CHIPCFG: CANFD2DIS Position     */
#define SYS_CHIPCFG_CANFD2DIS_Msk        (0x1ul << SYS_CHIPCFG_CANFD2DIS_Pos)              /*!< SYS_T::CHIPCFG: CANFD2DIS Mask         */

#define SYS_CHIPCFG_CANFD3DIS_Pos        (7)                                               /*!< SYS_T::CHIPCFG: CANFD3DIS Position     */
#define SYS_CHIPCFG_CANFD3DIS_Msk        (0x1ul << SYS_CHIPCFG_CANFD3DIS_Pos)              /*!< SYS_T::CHIPCFG: CANFD3DIS Mask         */

#define SYS_CHIPCFG_DDRTYPE_Pos          (14)                                              /*!< SYS_T::CHIPCFG: DDRTYPE Position       */
#define SYS_CHIPCFG_DDRTYPE_Msk          (0x3ul << SYS_CHIPCFG_DDRTYPE_Pos)                /*!< SYS_T::CHIPCFG: DDRTYPE Mask           */

#define SYS_CHIPCFG_DRAMSIZE_Pos         (16)                                              /*!< SYS_T::CHIPCFG: DRAMSIZE Position      */
#define SYS_CHIPCFG_DRAMSIZE_Msk         (0xful << SYS_CHIPCFG_DRAMSIZE_Pos)               /*!< SYS_T::CHIPCFG: DRAMSIZE Mask          */

#define SYS_CHIPCFG_DDRVENDR_Pos         (20)                                              /*!< SYS_T::CHIPCFG: DDRVENDR Position      */
#define SYS_CHIPCFG_DDRVENDR_Msk         (0x3ul << SYS_CHIPCFG_DDRVENDR_Pos)               /*!< SYS_T::CHIPCFG: DDRVENDR Mask          */

#define SYS_CHIPCFG_DDRPRCES_Pos         (22)                                              /*!< SYS_T::CHIPCFG: DDRPRCES Position      */
#define SYS_CHIPCFG_DDRPRCES_Msk         (0x3ul << SYS_CHIPCFG_DDRPRCES_Pos)               /*!< SYS_T::CHIPCFG: DDRPRCES Mask          */

#define SYS_CHIPCFG_APPID_Pos            (24)                                              /*!< SYS_T::CHIPCFG: APPID Position         */
#define SYS_CHIPCFG_APPID_Msk            (0xfful << SYS_CHIPCFG_APPID_Pos)                 /*!< SYS_T::CHIPCFG: APPID Mask             */

#define SYS_IBRAENCLR_IBRACCENCLR_Pos    (0)                                               /*!< SYS_T::IBRAENCLR: IBRACCENCLR Position */
#define SYS_IBRAENCLR_IBRACCENCLR_Msk    (0xfffffffful << SYS_IBRAENCLR_IBRACCENCLR_Pos)   /*!< SYS_T::IBRAENCLR: IBRACCENCLR Mask     */

/**@}*/ /* SYS_CONST */
/**@}*/ /* end of SYS register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __SYS_REG_H__ */
